// ДЗ 3: Логічні оператори

// 1. Логічні оператори  порівняння та alert:
// Створіть змінні number1 та number2 і використайте оператори порівняння, щоб визначити, чи вони рівні.
// Виведіть результат за допомогою alert, щоб повідомити користувача про те, чи рівні числа.

let number1 = 5;
let number2 = 8;

alert(`Чи дорівнює число ${number1} числу ${number2}?  ${number1 === number2}`);

// 2. Метод вводу інформації та логічні порівняння:
// Використовуючи prompt, запросіть у користувача введення числа.
// Перевірте, чи введене число парне чи непарне.
// Виведіть результат з використанням console.log.

let value = Number(prompt("Введіть будь-яке число:"));
console.log(`Число ${value} парне? ${value % 2 == 0}`);

// 3. Логічні порівняння та введення-виведення:
// Використовуючи prompt, запитайте у користувача його вік.
// Перевірте, чи вік менше 18 років.
// Виведіть відповідне повідомлення про те, чи може користувач використовувати певний ресурс.

let age = Number(prompt("Введіть свій вік:"));
alert(`Чи може користувач використовувати певний ресурс? ${age >= 18}`);

// 4. Розрахунок вартості товару та console.log:
// Створіть змінну ціна та кількість товару і присвойте їм значення використовуючи prompt .
// Використовуйте математичні операції для обчислення вартості товару (ціна * кількість).
// Виведіть результат за допомогою console.log.

let price = Number(prompt("Введіть ціну товару:"));
let count = Number(prompt("Введіть кількість товару:"));
console.log(`Вартість товару становить: ${price * count} грн.`);

// 5. Розрахунок знижки на товар та alert:
// Використовуючи prompt, запросіть в користувача вартість товару.
// Розрахуйте знижку на товар у розмірі 50% від введеної вартості.
// Виведіть результат знижки за допомогою alert.

let productPrice = Number(prompt("Введіть ціну товару:"));
alert(
  `Вартість товару з урахуванням знижки 50% становить: ${productPrice / 2} грн.`
);
